[
  {
    "job_id": "D94A1A6B79",
    "job_url": "https://apply.workable.com/eva-pharma/j/D94A1A6B79/",
    "title": "Maintenance Engineer",
    "workplace_type": "On-site",
    "location": "6th of October City, Giza Governorate, Egypt",
    "department": "Egypt Cluster",
    "job_type": "Full time",
    "posted_date": "Posted today",
    "job_summary": "We are seeking a passionate and talented Maintenance Engineer to join our dynamic team.\nThe ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "key_responsibilities": "Conduct routine maintenance checks and repairs on production equipment and machinery to ensure optimal operational efficiency.\nAssist in the development and implementation of preventative maintenance programs to minimize downtime.\nDiagnose and troubleshoot equipment malfunctions, providing timely resolutions to minimize disruption.\nMaintain accurate records of maintenance activities and prepare reports for management review.",
    "requirements": "• Bachelor's degree in Mechanical Engineering,electrical or a related field.\n• 1-2years of experience in maintenance engineering within the pharmaceutical or manufacturing industry.\n• Strong troubleshooting and problem-solving skills.\n• Excellent communication and teamwork abilities."
  },
  {
    "job_id": "FD792E9B35",
    "job_url": "https://apply.workable.com/eva-pharma/j/FD792E9B35/",
    "title": "Employee Experience Specialist",
    "workplace_type": "On-site",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "People Operations",
    "job_type": "Full time",
    "posted_date": "Posted 1 day ago",
    "job_summary": "We are seeking a passionate and talented Employee Experience Specialist to join our dynamic team.",
    "key_responsibilities": "Design and implement initiatives that enhance the employee lifecycle across countries (on-boarding, retention and off-boarding).\nMonitor and analyze employee satisfaction and engagement metrics, and propose continuous improvement strategies.\nSupport the planning and execution of culture-building activities and employee events.\nCreate personalized on-boarding experiences to ensure smooth transitions for new hires.\nDevelop and implement initiatives that promote diversity, equity, and inclusion.\nEnsure a positive off-boarding process and gather exit insights for continuous improvement.",
    "requirements": "• Bachelor’s degree in Human Resources, Business Administration, Psychology, or a related field.\n• 1-2 years of experience in on-boarding, or a similar HR role.\n• Strong interpersonal and communication skills, with a focus on empathy and problem-solving.\n• Demonstrated ability to handle sensitive employee matters with confidentiality and professionalism.\n• Experience using HR systems and engagement survey tools is a plus.\n• Creative thinker with a proactive and collaborative mindset."
  },
  {
    "job_id": "4B127F2B90",
    "job_url": "https://apply.workable.com/eva-pharma/j/4B127F2B90/",
    "title": "Angola Area Manager",
    "workplace_type": "On-site",
    "location": "Angola, Eastern Cape, South Africa",
    "department": "SSA",
    "job_type": "Contract",
    "posted_date": "Posted 3 days ago",
    "job_summary": "We are seeking a passionate and talented Angola Area Managerto join our dynamic team. The\nideal candidate will contribute to our mission of enhancing human health and well-being,\nensuring that we meet the highest standards of excellence in our industry.",
    "key_responsibilities": "Develop and implement effective sales strategies to achieve targets and maximize market penetration.\nBuild and maintain strong relationships with healthcare professionals, key opinion leaders, and other stakeholders.\nProvide in-depth product knowledge and training to the sales team and healthcare providers.\nMonitor market trends, competitor activities, and customer feedback to identify opportunities and challenges.\nCollaborate with marketing and medical teams to ensure alignment and support for sales initiatives.",
    "requirements": "Bachelor’s degree in pharmaceutical sciences or Veterinary Medicine; advanced degree or certifications in healthcare or business is a plus.\nMinimum of 5 years of proven experience in pharmaceutical sales in Angola market.\nEnglish Language Proficiency is a must.\nStrong understanding of the therapeutic area and market dynamics.\nExcellent communication, negotiation, and interpersonal skills.\nAbility to develop and execute strategic sales plans.\nSelf-motivated, results-oriented, and able to work independently as well as part of a team."
  },
  {
    "job_id": "731ABDB162",
    "job_url": "https://apply.workable.com/eva-pharma/j/731ABDB162/",
    "title": "Product Owner",
    "workplace_type": "Hybrid",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "Digital Transformation",
    "job_type": "Full time",
    "posted_date": "Posted 4 days ago",
    "job_summary": "We are seeking a passionate and talented Product Owner to join our dynamic team. The ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "key_responsibilities": "Product Vision and Strategy: Define and communicate the product vision, strategy, and roadmap, ensuring alignment with overall company objectives.\nUser Understanding: Develop a deep understanding of user needs, pain points, and market opportunities through research, data analysis, and direct interaction.\nProduct Backlog Management: Own and prioritize the product backlog, ensuring it is transparent, visible, and reflects the most valuable work to be done.",
    "requirements": "• Bachelor’s degree in business administration, Computer Science, Marketing, or a related field (or equivalent practical experience).\n• Proven experience as a Product Owner or in a similar product management role.\n• Certified Scrum Product Owner (CSPO) or equivalent certification.\n• Experience with product management tools (e.g., Jira, Confluence, Trello).\n• Strong understanding of Agile principles and methodologies (e.g., Scrum, Kanban)."
  },
  {
    "job_id": "B75A3DCA0B",
    "job_url": "https://apply.workable.com/eva-pharma/j/B75A3DCA0B/",
    "title": "Scrum Master",
    "workplace_type": "Hybrid",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "Digital Transformation",
    "job_type": "Full time",
    "posted_date": "Posted 4 days ago",
    "job_summary": "We are seeking a passionate and talented Scrum Master to join our dynamic team.\nThe ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "key_responsibilities": "Facilitate all Scrum ceremonies, including sprint planning, daily stand-ups, sprint reviews, and sprint retrospectives, ensuring they are productive and time-boxed.\nCoach and mentor the development team, product owner, and stakeholders on Scrum principles, values, and practices.\nRemove impediments and roadblocks that hinder the team's progress.\nProtect the team from external distractions and ensure a focused and productive environment.\nFoster self-organization and empowerment within the development team.",
    "requirements": "• Bachelor's degree in Computer Science, Business Administration, or a related field (or equivalent practical experience).\n• Proven experience as a Scrum Master for at least one year (preferably more).\n• Solid understanding of Agile principles, Scrum framework, and other Agile methodologies (e.g., Kanban, Lean).\n• Excellent facilitation and coaching skills.\n• Familiarity with Agile project management tools (e.g., Jira, Confluence, Trello)."
  },
  {
    "job_id": "79CB853531",
    "job_url": "https://apply.workable.com/eva-pharma/j/79CB853531/",
    "title": "Quality Assurance Specialist - Hiring Day",
    "workplace_type": "On-site",
    "location": "6th of October City, Giza Governorate, Egypt",
    "department": "Operations Business Division",
    "job_type": "Full time",
    "posted_date": "Posted 6 days ago",
    "job_summary": "We are seeking a passionate and talented Quality Assurance Specialist to join our dynamic team.\nThe ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "key_responsibilities": "Check, evaluate critical tests and check to assure product quality.\nTrack and trend results, investigations, nonconformity, deviations, change control, and complaints.\nObserve the conditions of online and in-process for compliance.\nReview batch record for completeness, correctness, and compliance with IPC.",
    "requirements": "• Bachelor's Degree in Pharmaceutical Sciences.\n• 0-2 years of experience in a similar position.\n• Excellent communication and interpersonal skills, result-oriented personality with team-working ability and resilience, problem-solving Skills, details-oriented.\n• Fluency in spoken and written English is required.\n• Excellent knowledge of Microsoft Office Professional (Word, Excel, PowerPoint, MS Outlook).\n• Able to work rotational shifts."
  },
  {
    "job_id": "93A9AD039B",
    "job_url": "https://apply.workable.com/eva-pharma/j/93A9AD039B/",
    "title": "Private Health Insurance Market Access",
    "workplace_type": "On-site",
    "location": "Riyadh, Riyadh Province, Saudi Arabia, Jeddah, Makkah Province, Saudi Arabia",
    "department": "Saudi Cluster",
    "job_type": "Full time",
    "posted_date": "Posted 7 days ago",
    "job_summary": "",
    "key_responsibilities": "Develop and implement access strategies for product inclusion in private health insurance.\nPrepare and submit pricing files, dossiers, and value propositions to insurance payers.\nTrack and update product status across insurance companies.\nBuild and manage relationships with key stakeholders in private insurers and key accounts.\nCollaborate with internal teams (Sales, Marketing, Medical, Regulatory) to support access goals.\nMonitor the insurance landscape, identify access barriers, and propose actionable solutions.",
    "requirements": "• Bachelor’s degree in pharmacy, Medicine, or a related field\n• Minimum 3-5 years of experience in the same role in Pharma companies in Saudi Arabia (e.g., Market Access, Key Account Management, Sales Management, etc)\n• Strong understanding of the private insurance landscape in the region, with previous successful product inclusions within the private health insurance providers.\n• Strong network and relationships with private health insurance providers, key accounts, and CHI stakeholders.\n• Solid business acumen with awareness of regulatory and pricing frameworks (preferred)."
  },
  {
    "job_id": "A4CAEE35CF",
    "job_url": "https://apply.workable.com/eva-pharma/j/A4CAEE35CF/",
    "title": "Oracle SCM Professional (Principal Level)",
    "workplace_type": "Hybrid",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "Digital Transformation",
    "job_type": "Full time",
    "posted_date": "Posted 8 days ago",
    "job_summary": "We are seeking a passionate and talented Oracle SCM Professional to join our dynamic team.\nThe ideal candidate will contribute to our mission of enhancing human health and well-being,\nensuring that we meet the highest standards of excellence in our industry.",
    "key_responsibilities": "Serve as a techno-functional expert across Oracle SCM modules, including Inventory, Order Management, Purchasing, Manufacturing, Planning, and Warehouse Management.\nProvide advanced troubleshooting and resolution for complex Oracle SCM issues, coordinating with IT and Oracle support.\nLead configuration and customization efforts to align Oracle SCM with evolving business needs.\nDesign and implement enhancements and new functionalities within Oracle SCM, including Oracle Process Manufacturing (OPM) if applicable.",
    "requirements": "• Bachelor’s degree in Computer Science, supply chain management, Business Administration, Information Technology, or a related field.\n• 4-6 yrs of experience in Oracle SCM modules and supply chain processes, with a strong track record in techno-functional roles.\n• Experience with Oracle E-Business Suite (EBS) or Oracle Cloud SCM.\n• Experience with Oracle Process Manufacturing (OPM) is highly desirable.\n• Proficiency in Oracle reporting tools, SQL, and data analysis."
  },
  {
    "job_id": "9CD167AB03",
    "job_url": "https://apply.workable.com/eva-pharma/j/9CD167AB03/",
    "title": "Local Purchasing Specialist",
    "workplace_type": "On-site",
    "location": "6th of October City, Giza Governorate, Egypt",
    "department": "Operations Business Division",
    "job_type": "Full time",
    "posted_date": "Posted 10 days ago",
    "job_summary": "We are seeking a passionate and talented Local Purchasing Specialist  to join our dynamic team.\nThe ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "key_responsibilities": "Manage the procurement process for local purchases, ensuring compliance with company policies and procedures.\nSource and evaluate suppliers, negotiate contracts, and maintain relationships with vendors to achieve favorable terms.\nCollaborate with cross-functional teams to identify purchasing needs and develop procurement strategies.\nAnalyze purchasing data and market trends to recommend cost-saving initiatives and efficient purchasing practices.",
    "requirements": "• Bachelor's degree in Business Administration, Supply Chain Management is preferable.\n• 1-2 years of experience in purchasing or procurement, preferably within the pharmaceutical or manufacturing industry.\n• Strong negotiation and communication skills.\n• Proficient in MS Office applications and experience with procurement software is an advantage."
  },
  {
    "job_id": "94C45BF9CF",
    "job_url": "https://apply.workable.com/eva-pharma/j/94C45BF9CF/",
    "title": "Internal Communication Specialist",
    "workplace_type": "Hybrid",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "People Operations",
    "job_type": "Full time",
    "posted_date": "Posted 10 days ago",
    "job_summary": "We are seeking a passionate and talented Internal Communication Specialist to join our dynamic team.",
    "key_responsibilities": "Develop and execute internal communication strategies and campaigns.\nCreate engaging content for newsletters, announcements, and internal platforms.\nCoordinate with departments to ensure alignment of internal messaging.\nSupport in planning internal events and employee engagement initiatives.\nMonitor feedback and continuously improve communication channels.",
    "requirements": "• Bachelor’s degree in Mass Communication, Business Administration, or a related field.\n• 0–1 year of experience in a communication, HR, or administrative role (internships count!).\n• Excellent writing and verbal communication skills (English & Arabic).\n• Strong organizational skills and attention to detail.\n• Creativity and ability to engage employees through innovative messaging."
  },
  {
    "job_id": "A6B4307276",
    "job_url": "https://apply.workable.com/eva-pharma/j/A6B4307276/",
    "title": "Senior Labor Engagement Specialist",
    "workplace_type": "Hybrid",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "People Operations",
    "job_type": "Full time",
    "posted_date": "Posted 10 days ago",
    "job_summary": "We are looking for a Senior Labor Engagement Specialist who is passionate about building a productive and positive relationship with our workforce.\nThe ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "key_responsibilities": "Support and lead initiatives related to labor relations and employee engagement.\nAct as a point of contact between management and employees to address concerns and resolve conflicts.",
    "requirements": "• Bachelor’s degree in Law, Business Administration, Human Resources, or a related field.\n• 1–2 years of relevant experience in labor relations or employee engagement.\n• Strong understanding of Egyptian labor law and regulatory requirements.\n• Excellent interpersonal, negotiation, and conflict-resolution skills.\n• Ability to work independently and manage sensitive employee matters confidentially."
  },
  {
    "job_id": "5D677EB63E",
    "job_url": "https://apply.workable.com/eva-pharma/j/5D677EB63E/",
    "title": "Trade Marketing Manager",
    "workplace_type": "On-site",
    "location": "Giza, El Omraniya, Egypt",
    "department": "Egypt Cluster",
    "job_type": "Full time",
    "posted_date": "Posted 11 days ago",
    "job_summary": "We are seeking a passionate and talented Trade Marketing Manager to join our dynamic team.\nThe ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "key_responsibilities": "• Plan and implement trade marketing initiatives across pharmacy channels to drive sell-out.\n• Customize national marketing campaigns to meet the needs of specific trade channels.\n• Work closely with sales teams to ensure alignment on promotions, new launches, and merchandising standards.\n• Analyze sales and market data to identify growth opportunities and optimize ROI on trade activities.\n• Lead execution of campaigns, displays, and visibility programs",
    "requirements": "• Bachelor’s Degree in Business Administration, Marketing, or any relevant field (a pharmacy degree is a plus).\n• 3+ years of experience in trade marketing or brand activation within FMCG or pharmaceutical sectors.\n• Experience with modern trade, key accounts, or pharmacy channel activation is a plus.\n• Knowledge of market dynamics in Egypt’s pharmaceutical retail scene is a plus.\n• Proficiency in MS Office Programmes, familiarity with dashboards, and strong analytical, communication, and problem-solving skills are considered a plus, along with the ability to travel and handle multiple projects with ownership and drive."
  },
  {
    "job_id": "AC9B0DE469",
    "job_url": "https://apply.workable.com/eva-pharma/j/AC9B0DE469/",
    "title": "Oracle Development Professional (Principal Level)",
    "workplace_type": "Hybrid",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "Digital Transformation",
    "job_type": "Full time",
    "posted_date": "Posted 11 days ago",
    "job_summary": "We are seeking a passionate and talented Oracle Development Professional to join our dynamic team.\nThe ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "key_responsibilities": "Develop and maintain Oracle Forms, Reports, PL/SQL packages, and APEX applications.",
    "requirements": "• Bachelor’s degree in computer science, Information Systems, or related field.\n• 4 -7 years of experience as an Oracle Technical, including EBS R12.2+ environments.\n• Strong command of Oracle Forms, Reports, PL/SQL, and SQL.\n• Experience with Oracle EBS modules (e.g., Financials, SCM, HRMS). & APEX development lifecycle and deployment.\n• Understanding of software development methodologies (Agile/Scrum is a plus)."
  },
  {
    "job_id": "432025A7A4",
    "job_url": "https://apply.workable.com/eva-pharma/j/432025A7A4/",
    "title": "Motion Graphics Designer",
    "workplace_type": "Hybrid",
    "location": "Giza, El Omraniya, Egypt",
    "department": "Egypt Cluster",
    "job_type": "Full time",
    "posted_date": "Posted 11 days ago",
    "job_summary": "",
    "key_responsibilities": "",
    "requirements": ""
  },
  {
    "job_id": "29AC949ED6",
    "job_url": "https://apply.workable.com/eva-pharma/j/29AC949ED6/",
    "title": "Digital Marketing Executive",
    "workplace_type": "On-site",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "",
    "job_type": "",
    "posted_date": "Posted 15 days ago",
    "job_summary": "",
    "key_responsibilities": "",
    "requirements": ""
  },
  {
    "job_id": "C543AA7AE8",
    "job_url": "https://apply.workable.com/eva-pharma/j/C543AA7AE8/",
    "title": "Regulatory Affairs Specialist - Europe Cluster",
    "workplace_type": "Hybrid",
    "location": "Giza, El Omraniya, Egypt",
    "department": "Europe Cluster",
    "job_type": "Full time",
    "posted_date": "Posted 15 days ago",
    "job_summary": "",
    "key_responsibilities": "",
    "requirements": ""
  },
  {
    "job_id": "E57D4AFE61",
    "job_url": "https://apply.workable.com/eva-pharma/j/E57D4AFE61/",
    "title": "Production Specialist",
    "workplace_type": "On-site",
    "location": "6th of October City, Giza Governorate, Egypt",
    "department": "Operations Business Division",
    "job_type": "Full time",
    "posted_date": "Posted 15 days ago",
    "job_summary": "",
    "key_responsibilities": "",
    "requirements": ""
  },
  {
    "job_id": "BF9641B2D1",
    "job_url": "https://apply.workable.com/eva-pharma/j/BF9641B2D1/",
    "title": "Digital Marketing Specialist - HCP Platform",
    "workplace_type": "On-site",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "",
    "job_type": "",
    "posted_date": "Posted 15 days ago",
    "job_summary": "We are seeking a passionate and talented Digital Marketing Specialist – HCP Platform to join our dynamic team.\nThe ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "key_responsibilities": "Develop and execute digital marketing strategies tailored to healthcare professionals (HCPs).\nCreate and manage content for HCP-focused platforms, ensuring relevance and engagement.\nAnalyze digital marketing metrics and campaign performance to drive data-driven decisions.\nCollaborate with cross-functional teams, including medical and sales, to ensure alignment with brand and communication strategies.\nStay updated on digital marketing trends and best practices within the pharmaceutical industry.",
    "requirements": "• Bachelor's degree in Marketing, Communications, or related field.\n• 1-2 years of experience in digital marketing, preferably within the healthcare or pharmaceutical sectors.\n• Strong understanding of digital marketing tools and analytics.\n• Excellent communication and project management skills.\n• Fluency in English is required."
  },
  {
    "job_id": "8E67FF9610",
    "job_url": "https://apply.workable.com/eva-pharma/j/8E67FF9610/",
    "title": "Quality Director",
    "workplace_type": "On-site",
    "location": "Giza, El Omraniya, Egypt",
    "department": "Operations Business Division",
    "job_type": "Full time",
    "posted_date": "Posted 15 days ago",
    "job_summary": "",
    "key_responsibilities": "Quality Strategy & Compliance\n• Define and execute a quality strategy aligned with global standards (cGMP, FDA, EMA, WHO, SFDA).\n• Ensure full compliance across all manufacturing sites, CMOs, and API suppliers.\nOperational Quality Oversight\n• Lead QA, QC, and Microbiology to ensure efficient batch release and reliable market supply.\n• Oversee accurate testing, batch release, and stability programs.\nRegulatory Inspections & Audits\n• Manage preparation and response for regulatory inspections (FDA, EU QP, WHO, etc.).\n• Liaise with regulatory agencies during inspections and audits, ensuring prompt, transparent, and compliant responses to findings)\n·       Act as the subject matter expert (SME) for quality audits, inspections, and certifications\nRisk Management & Improvement\n• Lead risk identification, mitigation, and quality improvement initiatives.\nCross-functional Collaboration:\n·       Collaborate with senior leadership and other departments, including R&D, regulatory affairs and operations to resolve quality issues and develop innovative solutions.\n·       Support product development teams to ensure quality is embedded into new product development from the outset.",
    "requirements": "• Education: Bachelor’s in pharmacy (mandatory); master’s or certification in Quality Management (preferred).\n• Experience: 20+ years in pharmaceutical QA/QC, with 10+ years in senior leadership.\n• Expertise in global cGMP, QMS, and regulatory compliance (FDA, EMA, SFDA, WHO).\n• Proven track record in branded generics and international regulatory frameworks.\n• Solid performance in driving quality improvements and managing cross-functional teams.\n• Strong  expertise in  quality management systems, risk management, CAPA, and root cause analysis"
  },
  {
    "job_id": "705A5B2A21",
    "job_url": "https://apply.workable.com/eva-pharma/j/705A5B2A21/",
    "title": "M&A and Corporate Development Head",
    "workplace_type": "On-site",
    "location": "Dubai, Dubai, United Arab Emirates",
    "department": "",
    "job_type": "Full time",
    "posted_date": "Posted 16 days ago",
    "job_summary": "",
    "key_responsibilities": "Identify, evaluate and pursue global acquisition opportunities — companies, products, or marketing authorizations across different markets that fit with the company’s long-term goals.\nLead and manage the entire deal process, including negotiations, due diligence, and closing.\nOversee the integration of new acquisitions, ensuring smooth alignment and execution across all stakeholders\nMonitor market trends and assess competition to spot new opportunities that can strengthen the business.",
    "requirements": "• 10+ years of experience in mergers and acquisitions, corporate development, or strategic partnerships, preferably in the pharmaceutical, or healthcare industry, with a total years of 20+ years of experience\n• Proven experience managing M&A transactions, from deal identification to successful integration, including cross-border deals with complex regulatory and market challenges.\n• Demonstrated success in acquiring companies or marketing authorizations in different markets"
  },
  {
    "job_id": "A5E806AF21",
    "job_url": "https://apply.workable.com/eva-pharma/j/A5E806AF21/",
    "title": "Production Specialist",
    "workplace_type": "On-site",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "Operations Business Division",
    "job_type": "Full time",
    "posted_date": "Posted 16 days ago",
    "job_summary": "We are seeking a passionate and talented Production Specialist to join our dynamic team.\nThe ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "key_responsibilities": "Follow up on the entire production process: starting from raw material weighing, through processing, tablet compression, capsule filling, sachet filling, blistering, packaging, and ending with final delivery to the warehouse.\nSupervise production technicians, assign daily tasks, and ensure compliance with GMP, GDP, and safety procedures.\nEnsure proper cleaning and setup of machines as per work instructions before starting production.\nMonitor production conditions (e.g., temperature, humidity, machine logbooks) and report any malfunctions or deviations.\nEnsure accurate and complete batch documentation in real time, Report and follow up on machine issues or infrastructure problems.",
    "requirements": "• Bachelor’s degree in Pharmaceutical Sciences.\n• 0-2 years of experience in a similar position.\n• Excellent communication and interpersonal skills, Result-oriented personality with team working ability & resilience.\n• Fluency in spoken & written English is required, Excellent knowledge of Microsoft Office Professional (word, Excel, PowerPoint, MS Outlook)"
  },
  {
    "job_id": "E8EC68A278",
    "job_url": "https://apply.workable.com/eva-pharma/j/E8EC68A278/",
    "title": "Medical Advisor",
    "workplace_type": "Hybrid",
    "location": "Giza, El Omraniya, Egypt",
    "department": "Global Medical Affairs",
    "job_type": "Full time",
    "posted_date": "Posted 17 days ago",
    "job_summary": "We are seeking a passionate and talented Medical Advisor to join our dynamic team.\nThe ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "key_responsibilities": "•Medical Affairs Accountabilities\nServe as a scientific and medical expert for the company’s therapeutic area(s) and respective products, providing clinical and scientific support across various functions\n•Collaboration with Medical Experts\nBuild and maintain strong relationships with Key Opinion Leaders (KOLs), healthcare professionals, and other external stakeholders.\n• Evidence Generation\nProvide expertise in clinical trials/ studies design, protocol development, and data interpretation to ensure alignment with the company’s medical strategy, in addition to monitoring the respective research projects.\n• Medical Education and Internal Training\nLead and contribute to the development of training materials for internal stakeholders, such as sales, marketing, and medical teams.",
    "requirements": "• Medical degree, PharmD or relevant scientific background in life sciences. \"Post-graduate qualification or board certification in a relevant therapeutic area is a plus.\"\n• Minimum of 5 years of experience in the pharmaceutical industry or a related field, with 2-3 experience in medical affairs \"Cardiovascular, Diabetes or Immunology related experience is a plus.\"\n• Experience in managing and leading medical projects, research projects, and medical communications.\n• Good level of Medical Writing basics and related publications process.\n• Good level of Knowledge of GCP, research types, global processes and national regulations."
  },
  {
    "job_id": "168EF975BD",
    "job_url": "https://apply.workable.com/eva-pharma/j/168EF975BD/",
    "title": "Medical Representative (Limitless Naturals)",
    "workplace_type": "On-site",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "Limitless Naturals",
    "job_type": "Full time",
    "posted_date": "Posted 18 days ago",
    "job_summary": "We are seeking a passionate and talented Medical Representative to join our dynamic team from any region in Egypt. The ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "key_responsibilities": "Develops and implements plans (e.g., territory, account and call) that include goals, action plans, time frames and resources.\nEstablishes strong relationships with a broad base of health care constituents (e.g. physicians, private hospitals, pharmacies, teaching hospitals, targeted community hospitals, and community offices, etc) through one-on-one sales presentations, group discussions and medical meeting exhibits.\nDevelops and implements creative strategies in key accounts and key opinion leaders (KOLs).",
    "requirements": "• Bachelor's degree in a relevant field (e.g., Pharmacy)\n• 2025 graduates\n• Strong communication and interpersonal skills.\n• Self-motivated with a drive to succeed in a competitive sales environment.\n• Previous experience or Relevant internships are a plus but not required."
  },
  {
    "job_id": "440E62ED31",
    "job_url": "https://apply.workable.com/eva-pharma/j/440E62ED31/",
    "title": "Medical Representative",
    "workplace_type": "On-site",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "Egypt Cluster",
    "job_type": "Full time",
    "posted_date": "Posted 19 days ago",
    "job_summary": "We are seeking a passionate and talented Medical Representative from any region in Egypt to join our dynamic team.\nThe ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "key_responsibilities": "• Promotes assigned pharmaceutical products and drives sales growth by effectively managing the territory and executing strategic plans to target physicians in both institutional and private sectors.\n• Develops and implements plans (e.g., territory, account and call) that include goals, action plans, time frames and resources.\n• Establishes strong relationships with a broad base of health care constituents (e.g. physicians, private hospitals, pharmacies, teaching hospitals, targeted community hospitals, and community offices, etc) through one-on-one sales presentations, group discussions and medical meeting exhibits.\n• Develops and implements creative strategies in key accounts and key opinion leaders (KOLs).",
    "requirements": "• Bachelor's degree in a relevant field (e.g., Pharmacy, Veterinary medicine).\n• 2023 - 2025 graduates\n• Previous experience or relevant internships are a plus.\n• Strong communication, negotiation skills, problem-solving skills. and interpersonal skills.\n• A self-motivated professional with passion for healthcare and drive to improve patient care in a competitive sales environment."
  },
  {
    "job_id": "5363519693",
    "job_url": "https://apply.workable.com/eva-pharma/j/5363519693/",
    "title": "Quality Assurance IPC Professional",
    "workplace_type": "On-site",
    "location": "6th of october, Al Jīzah, Egypt",
    "department": "Operations Business Division",
    "job_type": "Full time",
    "posted_date": "Posted 21 days ago",
    "job_summary": "We are seeking a passionate and talented Quality Assurance IPC Professional to join our dynamic team.\nThe ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "key_responsibilities": "",
    "requirements": "• Bachelor Degree in Pharmaceutical Sciences or Science\n• 5-8 years Of experience\n• cGMP and Prevention of Cross Contamination.\n• cGMP Documentation (Sop).\n• CAPA & Change Control Management System."
  },
  {
    "job_id": "4464F783E6",
    "job_url": "https://apply.workable.com/eva-pharma/j/4464F783E6/",
    "title": "Group Product Manager",
    "workplace_type": "Hybrid",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "Egypt Cluster",
    "job_type": "Full time",
    "posted_date": "Posted 21 days ago",
    "job_summary": "We are seeking a passionate and talented Group Product Manager to join our dynamic team.\nThe ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "key_responsibilities": "Develop and execute strategic plans for a portfolio of pharmaceutical products.\nLead, coach, and support a team of product managers to ensure high performance.\nOversee product launches and go-to-market strategies in coordination with cross-functional teams.\nMonitor market trends and product performance to drive continuous improvement and growth.",
    "requirements": "• Bachelor’s degree in Pharmaceutical Sciences.\n• 10+ Years of progressive marketing experience.\n• People management experience is a must.\n• Marketing certification is preferred.\n• Experience in Bone, Pain or Immunology is preferred."
  },
  {
    "job_id": "B553591345",
    "job_url": "https://apply.workable.com/eva-pharma/j/B553591345/",
    "title": "Chief Supply Chain Officer",
    "workplace_type": "On-site",
    "location": "Dubai, Dubai, United Arab Emirates",
    "department": "Operations Business Division",
    "job_type": "Full time",
    "posted_date": "Posted 21 days ago",
    "job_summary": "We are seeking a visionary and accomplished Chief Supply Chain Officer (CSCO) to lead global sourcing, procurement, planning, and logistics operations. Reporting directly to the CEO, this role will drive the global supply chain strategy to support EVA Pharma’s growth and international expansion",
    "key_responsibilities": "Strategic Leadership: Develop global sourcing/procurement strategies; lead cross-regional supply chain hubs (India, China, and UAE).\nSupplier Management: Oversee key supplier partnerships, contract negotiations, and API trading activities.\nOperational Excellence: Drive end-to-end supply chain transformation to enhance speed-to-market, reduce total cost, and improve service levels globally.\"\nLogistics Oversight: Ensure efficient, compliant inbound/outbound logistics across all markets.\nPlanning and Sales and Operation Planning(S&OP): Lead global planning and S&OP processes in alignment with Commercial, R&D, Finance, and Manufacturing to ensure product availability, efficient launches, and optimized inventory.\nFinancial Accountability: Manage supply chain budgets, cost savings, and financial transparency.\nInternational Compliance: Represent EVA Pharma globally; ensure regulatory compliance in sourcing and logistics.",
    "requirements": "• 20+ years of experience in pharmaceutical supply chain management, with 10+ years in senior leadership.\n• Bachelor’s degree in a relevant field such as Business, Engineering, Pharmacy, Supply Chain Management, is required; an MBA or equivalent advanced degree is strongly preferred.\n• Proven track record in managing complex, multi-country operations, including API sourcing, cross-border logistics, and regulatory compliance.\n• Strong entrepreneurial mindset with a proven ability to build agile, scalable supply chain models that support business growth and innovation.\n• Fluency in English is Required."
  },
  {
    "job_id": "A4CE4D846B",
    "job_url": "https://apply.workable.com/eva-pharma/j/A4CE4D846B/",
    "title": "Regulatory Affairs Specialist",
    "workplace_type": "On-site",
    "location": "Cairo, Al Qāhirah, Egypt",
    "department": "Regulatory Affairs",
    "job_type": "Full time",
    "posted_date": "Posted 22 days ago",
    "job_summary": "We are seeking a passionate and talented Regulatory Affairs Specialist to join our dynamic team.\nThe ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "key_responsibilities": "Regulatory Compliance – Ensure all products meet international regulations, serving as the primary regulatory contact for our international hubs.\nProduct Registration – Prepare, submit, and manage dossiers for new drugs, renewals, and variations, guiding approvals from start to finish.\nCompliance Monitoring – Stay ahead of evolving regulations, advising internal teams on critical updates to maintain full compliance.\nLabeling & Packaging Review – Ensure all pharma labeling, packaging, and promotional materials adhere to regulatory standards.",
    "requirements": ""
  },
  {
    "job_id": "25D8AB4357",
    "job_url": "https://apply.workable.com/eva-pharma/j/25D8AB4357/",
    "title": "PHI Field Market Access",
    "workplace_type": "On-site",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "Egypt Cluster",
    "job_type": "Full time",
    "posted_date": "Posted 24 days ago",
    "job_summary": "We are seeking a passionate and talented PHI Field Market Access to join our dynamic team.\nThe ideal candidate will contribute to our mission of enhancing human health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "key_responsibilities": "Develop and implement strategic access plans for EVA Pharma products with private healthcare insurance providers.\nBuild and maintain key relationships with decision-makers to ensure patient access and drive product performance.\nDefine business strategies, optimize resource allocation, and analyze market dynamics within the health insurance sector.\nBuild strong connections with PHI decision-makers to ensure understanding of product value and manage stakeholders supporting patient access to EVA Pharma portfolio.",
    "requirements": "• Bachelor’s Degree in Pharmaceutical Sciences.\n• Fluency in spoken & written English is required.\n• 2-3 years of experience in PHI Access, and/or Field market access, Self-Insured, and Private Hospitals in Egypt.\n• Experience with value-based projects and health economics."
  },
  {
    "job_id": "655BA9C2F8",
    "job_url": "https://apply.workable.com/eva-pharma/j/655BA9C2F8/",
    "title": "Scientific Sales Representative (Poultry Line)",
    "workplace_type": "On-site",
    "location": "Dakahlia, Ad Daqahlīyah, Egypt",
    "department": "Animal Health",
    "job_type": "",
    "posted_date": "Posted 24 days ago",
    "job_summary": "We are seeking a passionate and talented Scientific Sales Representative-Poultry Line to join our dynamic team.\nThe ideal candidate will contribute to our mission of enhancing animal health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "key_responsibilities": "Sales & Promotion: Achieve sales targets by promoting EVA Pharma Animal Health products to veterinary clinics, pharmacies, farms, and feed mills.\nScientific Detailing: Conduct effective visits and engage in seminars and workshops to boost product awareness and credibility.\nCustomer Relationships: Build strong, trust-based relationships with clients and key stakeholders.\nMarket Insights: Report on competitor activities, market trends, and customer needs.\nTeam Collaboration: Attend internal trainings and coordinate with cross-functional teams.",
    "requirements": "• Bachelor’s degree in Veterinary Medicine. (Poultry)\n• 0–2 years of sales or promotion experience (animal health/pharma preferred).\n• Strong communication and scientific presentation skills.\n• Valid driver’s license and readiness to travel.\n• Proficiency in Microsoft Office; CRM experience is a plus."
  },
  {
    "job_id": "82332B6E0D",
    "job_url": "https://apply.workable.com/eva-pharma/j/82332B6E0D/",
    "title": "Scientific Sales Representative (Ruminant Line)",
    "workplace_type": "On-site",
    "location": "Dakahlia, Ad Daqahlīyah, Egypt",
    "department": "Animal Health",
    "job_type": "",
    "posted_date": "Posted 24 days ago",
    "job_summary": "We are seeking a passionate and talented Scientific Sales Representative-Ruminant Line to join our dynamic team.\nThe ideal candidate will contribute to our mission of enhancing animal health and well-being, ensuring that we meet the highest standards of excellence in our industry.",
    "key_responsibilities": "",
    "requirements": "• Sales & Promotion: Achieve sales targets by promoting EVA Pharma Animal Health products to veterinary clinics, pharmacies, farms, and feed mills.\n• Scientific Detailing: Conduct effective visits and engage in seminars and workshops to boost product awareness and credibility.\n• Customer Relationships: Build strong, trust-based relationships with clients and key stakeholders.\n• Market Insights: Report on competitor activities, market trends, and customer needs.\n• Team Collaboration: Attend internal trainings and coordinate with cross-functional teams.\n• Bachelor’s degree in Veterinary Medicine. (Ruminant)\n• 0–2 years of sales or promotion experience (animal health/pharma preferred).\n• Strong communication and scientific presentation skills.\n• Valid driver’s license and readiness to travel.\n• Proficiency in Microsoft Office; CRM experience is a plus."
  },
  {
    "job_id": "D8416FC5B4",
    "job_url": "https://apply.workable.com/eva-pharma/j/D8416FC5B4/",
    "title": "Senior Electrical Engineer",
    "workplace_type": "On-site",
    "location": "6th of October City, Giza Governorate, Egypt",
    "department": "Operations Business Division",
    "job_type": "Full time",
    "posted_date": "Posted 25 days ago",
    "job_summary": "",
    "key_responsibilities": "",
    "requirements": ""
  },
  {
    "job_id": "ECC38B9A9F",
    "job_url": "https://apply.workable.com/eva-pharma/j/ECC38B9A9F/",
    "title": "Medical Promotion Specialist",
    "workplace_type": "On-site",
    "location": "Jeddah, Makkah Province, Saudi Arabia, Dammam, Eastern Province, Saudi Arabia",
    "department": "Saudi Cluster",
    "job_type": "Full time",
    "posted_date": "Posted 28 days ago",
    "job_summary": "",
    "key_responsibilities": "",
    "requirements": ""
  },
  {
    "job_id": "88356AF51A",
    "job_url": "https://apply.workable.com/eva-pharma/j/88356AF51A/",
    "title": "PHI Key Account Manager",
    "workplace_type": "On-site",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "Egypt Cluster",
    "job_type": "Full time",
    "posted_date": "Posted 28 days ago",
    "job_summary": "",
    "key_responsibilities": "",
    "requirements": ""
  },
  {
    "job_id": "1E8E996127",
    "job_url": "https://apply.workable.com/eva-pharma/j/1E8E996127/",
    "title": "Microbiology Specialist",
    "workplace_type": "On-site",
    "location": "6th of October City, Giza Governorate, Egypt",
    "department": "Operations Business Division",
    "job_type": "Full time",
    "posted_date": "Posted about 1 month ago",
    "job_summary": "",
    "key_responsibilities": "",
    "requirements": ""
  },
  {
    "job_id": "F40A85DDF7",
    "job_url": "https://apply.workable.com/eva-pharma/j/F40A85DDF7/",
    "title": "Quality Control Specialist",
    "workplace_type": "On-site",
    "location": "6th of October City, Giza Governorate, Egypt",
    "department": "Operations Business Division",
    "job_type": "Full time",
    "posted_date": "Posted about 1 month ago",
    "job_summary": "",
    "key_responsibilities": "",
    "requirements": ""
  },
  {
    "job_id": "9DCA851185",
    "job_url": "https://apply.workable.com/eva-pharma/j/9DCA851185/",
    "title": "IT Help Desk Engineer",
    "workplace_type": "Hybrid",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "Digital Transformation",
    "job_type": "Full time",
    "posted_date": "Posted about 1 month ago",
    "job_summary": "",
    "key_responsibilities": "",
    "requirements": ""
  },
  {
    "job_id": "E1F018AB8A",
    "job_url": "https://apply.workable.com/eva-pharma/j/E1F018AB8A/",
    "title": "Quality Assurance Specialist",
    "workplace_type": "On-site",
    "location": "6th of October City, Giza Governorate, Egypt",
    "department": "Operations Business Division",
    "job_type": "Full time",
    "posted_date": "Posted about 1 month ago",
    "job_summary": "",
    "key_responsibilities": "",
    "requirements": ""
  },
  {
    "job_id": "3C227189B9",
    "job_url": "https://apply.workable.com/eva-pharma/j/3C227189B9/",
    "title": "CRM Project Manager",
    "workplace_type": "Hybrid",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "Digital Transformation",
    "job_type": "Full time",
    "posted_date": "Posted about 1 month ago",
    "job_summary": "",
    "key_responsibilities": "",
    "requirements": ""
  },
  {
    "job_id": "3B1C0916CB",
    "job_url": "https://apply.workable.com/eva-pharma/j/3B1C0916CB/",
    "title": "Nigeria Area Supervisor",
    "workplace_type": "On-site",
    "location": "Abuja (F.c.t.), Federal Capital Territory, Nigeria, Lagos, Lagos, Nigeria",
    "department": "SSA",
    "job_type": "Full time",
    "posted_date": "Posted about 1 month ago",
    "job_summary": "",
    "key_responsibilities": "",
    "requirements": ""
  },
  {
    "job_id": "6B310802BC",
    "job_url": "https://apply.workable.com/eva-pharma/j/6B310802BC/",
    "title": "Quality Assurance Specialist",
    "workplace_type": "On-site",
    "location": "Giza, El Omraniya, Egypt",
    "department": "Operations Business Division",
    "job_type": "Full time",
    "posted_date": "Posted about 1 month ago",
    "job_summary": "",
    "key_responsibilities": "",
    "requirements": ""
  },
  {
    "job_id": "4C6997FFCC",
    "job_url": "https://apply.workable.com/eva-pharma/j/4C6997FFCC/",
    "title": "Labor engagement Senior Business Partner",
    "workplace_type": "Hybrid",
    "location": "Giza, El Omraniya, Egypt",
    "department": "People Operations",
    "job_type": "Full time",
    "posted_date": "Posted about 1 month ago",
    "job_summary": "",
    "key_responsibilities": "",
    "requirements": ""
  },
  {
    "job_id": "5ECE572A8A",
    "job_url": "https://apply.workable.com/eva-pharma/j/5ECE572A8A/",
    "title": "UX Designer",
    "workplace_type": "Hybrid",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "Digital Transformation",
    "job_type": "Full time",
    "posted_date": "Posted about 1 month ago",
    "job_summary": "",
    "key_responsibilities": "",
    "requirements": ""
  },
  {
    "job_id": "3CE461DF1C",
    "job_url": "https://apply.workable.com/eva-pharma/j/3CE461DF1C/",
    "title": "Senior Financial Analyst - Supply Chain",
    "workplace_type": "Hybrid",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "Finance",
    "job_type": "Full time",
    "posted_date": "Posted about 1 month ago",
    "job_summary": "",
    "key_responsibilities": "",
    "requirements": ""
  },
  {
    "job_id": "87A579DCAC",
    "job_url": "https://apply.workable.com/eva-pharma/j/87A579DCAC/",
    "title": "Cost Accountant",
    "workplace_type": "On-site",
    "location": "6th of October City, Giza Governorate, Egypt",
    "department": "Finance",
    "job_type": "Full time",
    "posted_date": "Posted about 1 month ago",
    "job_summary": "",
    "key_responsibilities": "",
    "requirements": ""
  },
  {
    "job_id": "9CF09F8ED1",
    "job_url": "https://apply.workable.com/eva-pharma/j/9CF09F8ED1/",
    "title": "Senior Accountant / GCC (Egypt Based)",
    "workplace_type": "On-site",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "Finance",
    "job_type": "Full time",
    "posted_date": "Posted about 2 months ago",
    "job_summary": "",
    "key_responsibilities": "",
    "requirements": ""
  },
  {
    "job_id": "9DD40B461A",
    "job_url": "https://apply.workable.com/eva-pharma/j/9DD40B461A/",
    "title": "Senior Maintenance Engineer",
    "workplace_type": "On-site",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "Operations Business Division",
    "job_type": "Full time",
    "posted_date": "Posted about 2 months ago",
    "job_summary": "",
    "key_responsibilities": "",
    "requirements": ""
  },
  {
    "job_id": "99F60E00A5",
    "job_url": "https://apply.workable.com/eva-pharma/j/99F60E00A5/",
    "title": "Senior Administration Assistant",
    "workplace_type": "On-site",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "Regulatory Affairs",
    "job_type": "Full time",
    "posted_date": "Posted about 2 months ago",
    "job_summary": "",
    "key_responsibilities": "",
    "requirements": ""
  },
  {
    "job_id": "B339627AB0",
    "job_url": "https://apply.workable.com/eva-pharma/j/B339627AB0/",
    "title": "Senior R&D Researcher - Biologics & mRNA - R&D - EVA Pharma - October - Egypt",
    "workplace_type": "On-site",
    "location": "Cairo, Cairo Governorate, Egypt",
    "department": "",
    "job_type": "Full time",
    "posted_date": "Posted 2 months ago",
    "job_summary": "",
    "key_responsibilities": "",
    "requirements": ""
  }
]